# Working with columns

### Introduction

In the last lesson, we learned about selecting loading in data with a pandas dataframe, and learned about the components of a dataframe, series, and index.  In this lesson, we'll dig further into working with a dataframe by seeing how we can better explore our data by selecting specific *columns* from a dataframe -- after all this is a lot of what we'll do in pandas.  

Ok, let's see this.

### Exploring Columns

We'll start by once again loading up our data.

In [1]:
import pandas as pd
url = "https://raw.githubusercontent.com/jigsawlabs-student/pandas-free-curriculum/master/houston_claims.csv"
df = pd.read_csv(url, index_col = 0)
df[:1]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,HOUSTON,2017-08-27T00:00:00.000Z,False,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea

Now let's see a list of all of the columns by using the `columns` method.

In [ ]:
df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

### Selecting a single column

Once we've seen the various columns in our dataframe, it's time to select a specific column to focus in on.  We do so by using the bracket accessors `[]`.

In [ ]:
df['dateOfLoss']

0        2017-08-27T00:00:00.000Z
1        2008-09-12T00:00:00.000Z
2        2004-06-29T00:00:00.000Z
3        2009-04-28T00:00:00.000Z
4        2001-06-09T00:00:00.000Z
                   ...
19995    2017-08-26T00:00:00.000Z
19996    2015-05-26T00:00:00.000Z
19997    2017-08-27T00:00:00.000Z
19998    2016-04-18T00:00:00.000Z
19999    2017-08-26T00:00:00.000Z
Name: dateOfLoss, Length: 20000, dtype: object

So above we saw that one way to select a column with our bracket accessors, `[]`.  A second way to select a specific column is with the dot notation and the name of the column.

In [ ]:
df.dateOfLoss

0        2017-08-27T00:00:00.000Z
1        2008-09-12T00:00:00.000Z
2        2004-06-29T00:00:00.000Z
3        2009-04-28T00:00:00.000Z
4        2001-06-09T00:00:00.000Z
                   ...
19995    2017-08-26T00:00:00.000Z
19996    2015-05-26T00:00:00.000Z
19997    2017-08-27T00:00:00.000Z
19998    2016-04-18T00:00:00.000Z
19999    2017-08-26T00:00:00.000Z
Name: dateOfLoss, Length: 20000, dtype: object

Now oftentimes, we'll want to hold onto a column by assigning a selected column to a variable.  Below, assign the column `amountPaidOnBuildingClaim` to the variable `building_amount`.

In [ ]:
building_amount = None

### Selecting mulitple columns

Now let's move onto selecting multiple columns.  Once again, we'll start by looking at all of our columns.

In [ ]:
df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

And now let's select use the bracket accessors to select the columns `latitude` and `longitude` and `amountPaidOnBuildingClaim`.

In [ ]:
columns = ['latitude', 'longitude', 'amountPaidOnBuildingClaim']
selected_df = df[columns]
selected_df[:3]

   latitude  longitude  amountPaidOnBuildingClaim
0      29.7      -95.5                  195857.43
1      29.5      -95.1                       0.00
2      29.8      -95.6                    1420.89

So we just greatly reduced the number of columns, and assigned this smaller dataframe to `selected_df`.  Let's go over how we did this.

This is the format:

* dataframe, bracket accessors, list of columns

```python
df[ ['col_1', 'col_2']]
```

It can be hard to keep track of all of those brackets, so it is nice to first assign the list of columns to a variable.

In [ ]:
columns = ['latitude', 'longitude', 'amountPaidOnBuildingClaim']
selected_df = df[columns]
selected_df[:3]

   latitude  longitude  amountPaidOnBuildingClaim
0      29.7      -95.5                  195857.43
1      29.5      -95.1                       0.00
2      29.8      -95.6                    1420.89

Notice that selecting *multiple columns* from a dataframe, we have a dataframe.

In [ ]:
type(df[['latitude', 'longitude']])

pandas.core.frame.DataFrame

But if we select only a single column from a dataframe, we have a series.

In [ ]:
type(df['amountPaidOnBuildingClaim'])

pandas.core.series.Series

### Dropping Columns

Just like we can select columns, we can also drop columns.

> Let's load up our data again.

In [ ]:
import pandas as pd
url = "https://raw.githubusercontent.com/jigsawlabs-student/pandas-free-curriculum/master/houston_claims.csv"
df = pd.read_csv(url, index_col = 0)
df[:2]

,reportedCity,dateOfLoss,elevatedBuildingIndicator,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,HOUSTON,2017-08-27T00:00:00.000Z,False,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
1,HOUSTON,2008-09-12T00:00:00.000Z,False,X,29.5,-95.1,NaN,0.00,0.0,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc

In [ ]:
df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

We can provide a list of columns to drop with the `drop` method.  The method returns to us a new dataframe with the specified columns removed.

In [ ]:
df_dropped = df.drop(columns = ['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator'])
df_dropped[:4]

,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
1,X,29.5,-95.1,NaN,0.00,0.0,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc
2,X,29.8,-95.6,NaN,1420.89,0.0,2004-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4b
3,X,29.8,-95.6,NaN,2019.66,0.0,2009-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4c

### Summary

In this lesson, we learned about how to select columns from our pandas dataframe.  We can start by seeing all of the columns with `columns` method.

In [ ]:
df.columns

Index(['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator', 'floodZone',
       'latitude', 'longitude', 'lowestFloodElevation',
       'amountPaidOnBuildingClaim', 'amountPaidOnContentsClaim', 'yearofLoss',
       'reportedZipcode', 'id'],
      dtype='object')

We can select a single column by either using the bracket accessors or the dot notation, and then assign that column a variable.

In [ ]:
loss_date = df['dateOfLoss']

In [ ]:
loss_date = df.dateOfLoss

We can select multiple columns by still using the bracket accessors, and then passing through a list of columns that we would like to select.

In [ ]:
columns = ['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator']
selected = df[columns]
selected[:3]

  reportedCity                dateOfLoss elevatedBuildingIndicator
0      HOUSTON  2017-08-27T00:00:00.000Z                     False
1      HOUSTON  2008-09-12T00:00:00.000Z                     False
2      HOUSTON  2004-06-29T00:00:00.000Z                     False

We can also drop multiple columns with the `drop` method.

In [ ]:
df_dropped = df.drop(columns = ['reportedCity', 'dateOfLoss', 'elevatedBuildingIndicator'])
df_dropped[:4]

,floodZone,latitude,longitude,lowestFloodElevation,amountPaidOnBuildingClaim,amountPaidOnContentsClaim,yearofLoss,reportedZipcode,id
0,X,29.7,-95.5,NaN,195857.43,0.0,2017-01-01T00:00:00.000Z,77096,5e398d6774cbd479fc898dea
1,X,29.5,-95.1,NaN,0.00,0.0,2008-01-01T00:00:00.000Z,77058,5e398d6774cbd479fc898dfc
2,X,29.8,-95.6,NaN,1420.89,0.0,2004-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4b
3,X,29.8,-95.6,NaN,2019.66,0.0,2009-01-01T00:00:00.000Z,77042,5e398d6774cbd479fc898e4c